УТ_для_edt/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ИсторияСостоянийОбращений/CRM_ИсторияСостоянийОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ИсторияСостоянийОбращений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>смартСтатусRoistat</name>
    <comment>#Б-1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов</comment>
    <type>
      <types>CatalogRef.смартСтатусыRoistat</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обращение</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартПроксиЛидыROIStat/смартПроксиЛидыROIStat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартПроксиЛидыROIStat</name>
  <comment>//++ #Б-1678 смарт: Фролов 12.12.2024 //Интеграция с ROIStat. Загрузка ProxyLeads. Создать регистр сведений</comment>
  <resources>
    <name>НеИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерВизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСделки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеПоля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоСпам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторROIStat</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартТипыСтатусовRoistat/смартТипыСтатусовRoistat.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыСтатусовRoistat</name>
  <comment>#Б-1538 смарт: Лопато 05.12.2024 //Интеграция с ROIStat. Добавить справочник Статусы ROIStat, доработать регистр состояний Интересов</comment>
  <enumValues>
    <name>progress</name>
  </enumValues>
  <enumValues>
    <name>paid</name>
  </enumValues>
  <enumValues>
    <name>canceled</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовКлиентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяАвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплатаПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СостоянияСобытий/CRM_СостоянияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияСобытий</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Запланировано</name>
      <description>Запланировано</description>
    </items>
    <items>
      <name>Отменено</name>
      <description>Отменено</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостояния</name>
    <type>
      <types>EnumRef.CRM_ТипыСостоянийСобытий</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартИнтеграцияRoistat/Module.bsl
/////////////////////////////////////////////////////////////////////////////
// Модуль смартИнтеграцияRoistat предназначен для 
// хранения процедур и функций, связанных с обменом  
// данными с сервисом Roistat (roistat.com)
/////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура - Процедура выполняет обмен
//  
Процедура ВыполнитьЗаданиеОбменRoistat(Параметры) Экспорт
	
	ЭтоОбменПоРегламентномуЗаданию = Ложь;
	
	Если ТипЗнч(Параметры) = Тип("Строка") Тогда
		
		//Запуск по регламентному задани
		ЭтоОбменПоРегламентномуЗаданию = Истина;
		
		Параметры = Новый Структура("УзелОбмена", ПланыОбмена.смартОбменRoistat.НайтиПоКоду(Параметры));
		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Параметры.УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОбмена = ПолучитьНастройкиОбменаУзлаRoistat(Параметры.УзелОбмена);
	
	Если НЕ ЗначениеЗаполнено(НастройкиОбмена.URL)
		ИЛИ НЕ ЗначениеЗаполнено(НастройкиОбмена.RoistatProject)
		ИЛИ НЕ ЗначениеЗаполнено(ПолучитьRoistatAPIKey()) Тогда

		ЗаписьЖурналаРегистрации("Обмен с Roistat", УровеньЖурналаРегистрации.Ошибка, ,
								 "Roistat APIKey, Roistat URL и Roistat Project должны быть заполнены", 
								 "Не удалось выгрузить в Roistat");
		
		Возврат;
		
	КонецЕсли;	

	Если ЭтоОбменПоРегламентномуЗаданию 
		И НЕ НастройкиОбмена.ИспользоватьРегламентныеЗадания Тогда
		
		Возврат;
		
	КонецЕсли;
	
	//Выгрузка статусов
	ВыполнитьОбменRoistat(НастройкиОбмена, "Справочник.смартСтатусыRoistat", "set-statuses");
	
	//Выгрузка интересов
	ВыполнитьОбменRoistat(НастройкиОбмена, "Документ.CRM_Интерес", "add-orders");

	//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
	//Выгрузка заказов
	ВыполнитьОбменRoistat(НастройкиОбмена, "Документ.ЗаказКлиента", "add-orders");
	//-- #Б-2560 смарт: Лопато 11.03.2025
	
	//++ #Б-1680 смарт: Лопато 13.12.2024 //Интеграция с ROIStat. Загрузка ProxyLeads. Загрузить данные.  
	НачалоПериода 	 = Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd");
	ОкончаниеПериода = Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd");

	//Загрузка ProxyLeads
	ВыполнитьЗагрузкуRoistat(НастройкиОбмена, "proxy-leads", , , НачалоПериода, ОкончаниеПериода);
	//-- #Б-1680 смарт: Лопато 13.12.2024
	
КонецПроцедуры

Функция ВыполнитьОбменRoistat(НастройкиОбмена, ОбъектВыгрузки, Сервис) Экспорт
	
	Результат = Ложь;
	
	Если ТипЗнч(ОбъектВыгрузки) = Тип("Строка") Тогда
		МассивОбъектов = ПолучитьИзмененияПоУзлу(НастройкиОбмена.Ссылка, ОбъектВыгрузки);
	ИначеЕсли ТипЗнч(ОбъектВыгрузки) = Тип("Массив") Тогда	
    	МассивОбъектов = ОбъектВыгрузки;
	КонецЕсли;	
		
	Если МассивОбъектов.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ПараметрыОбмена = ПолучитьПараметрыОбменаRoistat(НастройкиОбмена.Url, НастройкиОбмена.RoistatProject, Сервис);
	
	//Выгрузка статусов
	Если Сервис = "set-statuses" Тогда
		
		СтруктураДанных = ПолучитьДанныеСтатусовRoistat();
		
	//Выгрузка интересов
	ИначеЕсли Сервис = "add-orders" Тогда
		
		//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
		НаименованиеОбъекта = ПолучитьНаименованиеОбъекта(ОбъектВыгрузки);
		
		МассивКлиентов = ПолучитьМассивКлиентов(МассивОбъектов, НаименованиеОбъекта);
		
		Если ВыполнитьОбменRoistat(НастройкиОбмена, МассивКлиентов, "clients") Тогда
			
			Если НаименованиеОбъекта = "Документ.CRM_Интерес" Тогда
			
				СтруктураДанных = ПолучитьДанныеИнтересовRoistat(МассивОбъектов);
				
			ИначеЕсли НаименованиеОбъекта = "Документ.ЗаказКлиента" Тогда

				СтруктураДанных = ПолучитьДанныеЗаказовRoistat(МассивОбъектов);
				
			КонецЕсли;	
		//-- #Б-2560 смарт: Лопато 11.03.2025
			
		Иначе
			
			ЗаписьЖурналаРегистрации("Обмен с Roistat", УровеньЖурналаРегистрации.Ошибка, , ,
									 "Не удалось выгрузить клиентов");
			Возврат Ложь;
			
		КонецЕсли;	
			
	//Выгрузка клиентов
	ИначеЕсли Сервис = "clients" Тогда
		
		ПараметрыОбмена.Вставить("resource", "import");

		СтруктураДанных = ПолучитьДанныеКлиентовRoistat(МассивОбъектов);
		
	КонецЕсли;
	
	ТелоЗапроса = ЗаписатьОбъектВJSON(СтруктураДанных.СтруктураТелаЗапроса);
	
	HTTPОтвет = ВыполнитьЗапросRoistat("POST", ПараметрыОбмена, ТелоЗапроса);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда

		ContentType = HTTPОтвет.Заголовки.Получить("Content-Type");

		Если Найти(ContentType, ПараметрыОбмена.Получить("accept")) > 0 Тогда
			
			ДанныеJSON = ПрочитатьОбъектИзJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
			
			Если ТипЗнч(ДанныеJSON) = Тип("Соответствие") 
				И ДанныеJSON.Получить("status") = "success" Тогда 
				
				Если СтруктураДанных.Свойство("МассивВыгруженныхСсылок")
					И СтруктураДанных.МассивВыгруженныхСсылок.Количество() > 0 Тогда
				
					ПланыОбмена.УдалитьРегистрациюИзменений(НастройкиОбмена.Ссылка, 
														    СтруктураДанных.МассивВыгруженныхСсылок);
					
				КонецЕсли;
														
				Результат = Истина;										
														
			Иначе
				
				ЗаписьЖурналаРегистрации("Обмен с Roistat", УровеньЖурналаРегистрации.Ошибка, ,
										 HTTPОтвет.ПолучитьТелоКакСтроку(), "Не удалось выгрузить данные");
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//++ #Б-1680 смарт: Лопато 13.12.2024 //Интеграция с ROIStat. Загрузка ProxyLeads. Загрузить данные.  
Функция ВыполнитьЗагрузкуRoistat(НастройкиОбмена, Сервис, Ресурс = "", Метод = "", НачалоПериода = "", ОкончаниеПериода = "") Экспорт
	
	Результат = Неопределено;
	
	ПараметрыОбмена = ПолучитьПараметрыОбменаRoistat(НастройкиОбмена.Url, 
													 НастройкиОбмена.RoistatProject, 
													 Сервис, 
													 Ресурс, 
													 Метод, 
													 НачалоПериода, 
													 ОкончаниеПериода);
	
	HTTPОтвет = ВыполнитьЗапросRoistat("GET", ПараметрыОбмена);
	
	Если HTTPОтвет.КодСостояния = 200 Тогда

		ContentType = HTTPОтвет.Заголовки.Получить("Content-Type");

		Если Найти(ContentType, ПараметрыОбмена.Получить("accept")) > 0 Тогда
			
			ДанныеJSON = ПрочитатьОбъектИзJSON(HTTPОтвет.ПолучитьТелоКакСтроку());
			
			Если ТипЗнч(ДанныеJSON) = Тип("Соответствие") 
				И ДанныеJSON.Получить("status") = "success" Тогда 

				Если Сервис = "proxy-leads" Тогда
					ЗагрузитьProxyLeads(ДанныеJSON.Получить("ProxyLeads"));
				КонецЕсли;
				
			Иначе
				
				ЗаписьЖурналаРегистрации("Обмен с Roistat", УровеньЖурналаРегистрации.Ошибка, ,
										 HTTPОтвет.ПолучитьТелоКакСтроку(), "Не удалось выполнить загрузку " + Сервис);
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

//++ #Б-1634 смарт: Лопато 10.12.2024 //Интеграция с ROIStat. Доработать регистр состояний Интересов. Оплата заказа  
Функция ПолучитьСостоянияИнтересовЗаказовRoistat(МассивЗаказов) Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(Журнал.Объект КАК Документ.ЗаказКлиента) КАК Заказ,
		|	ИсторияСостояний.Период КАК Период,
		|	ИсторияСостояний.Обращение КАК Обращение,
		|	ИсторияСостояний.Состояние КАК Состояние,
		|	ИсторияСостояний.ДатаЗавершения КАК ДатаЗавершения,
		|	ИсторияСостояний.смартСтатусRoistat КАК смартСтатусRoistat
		|ИЗ
		|	РегистрСведений.CRM_ЖурналДокументов КАК Журнал
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних(, ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)) КАК ИсторияСостояний
		|		ПО Журнал.CRM_Интерес = ИсторияСостояний.Обращение
		|ГДЕ
		|	Журнал.ГлавнаяЗапись
		|	И ВЫРАЗИТЬ(Журнал.Объект КАК Документ.ЗаказКлиента) В(&МассивЗаказов)";

	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции //-- #Б-1634 смарт: Лопато 10.12.2024

//++ #Б-1634 смарт: Лопато 10.12.2024 //Интеграция с ROIStat. Доработать регистр состояний Интересов. Оплата заказа  
Процедура ОбновитьЗаписьСостояниеИнтереса(ДанныеСостояния) Экспорт

	СтруктураЗаписиСостояний = Новый Структура;
	
	СтруктураЗаписиСостояний.Вставить("Период");
	СтруктураЗаписиСостояний.Вставить("Обращение");
	СтруктураЗаписиСостояний.Вставить("Состояние");
	СтруктураЗаписиСостояний.Вставить("ДатаЗавершения");
	СтруктураЗаписиСостояний.Вставить("смартСтатусRoistat");
	
	ЗаполнитьЗначенияСвойств(СтруктураЗаписиСостояний, ДанныеСостояния);
					
	ОбменДаннымиСлужебный.ОбновитьЗаписьВРегистрСведений(СтруктураЗаписиСостояний, "CRM_ИсторияСостоянийОбращений");
	
КонецПроцедуры //-- #Б-1634 смарт: Лопато 10.12.2024

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиОбменаУзлаRoistat(УзелОбмена)
	
	НастройкиОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		УзелОбмена, "
		|Ссылка, 
	    |URL, 
	    |RoistatProject,
		|ИспользоватьРегламентныеЗадания");
	
	Возврат НастройкиОбмена;
	
КонецФункции	

Функция ПолучитьДанныеСтатусовRoistat()

	Результат = Новый Структура;
	Результат.Вставить("СтруктураТелаЗапроса", Новый Массив);
	Результат.Вставить("МассивВыгруженныхСсылок", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка,
	|	Наименование КАК name,
	|	ВЫБОР КОГДА Тип = ЗНАЧЕНИЕ(Перечисление.смартТипыСтатусовRoistat.progress) ТОГДА ""progress""
	|		  КОГДА Тип = ЗНАЧЕНИЕ(Перечисление.смартТипыСтатусовRoistat.paid)     ТОГДА ""paid""
	|		  КОГДА Тип = ЗНАЧЕНИЕ(Перечисление.смартТипыСтатусовRoistat.canceled) ТОГДА ""canceled""
	|	КОНЕЦ КАК type 
	|ИЗ
	|	Справочник.смартСтатусыRoistat";

	ВыборкаЗначений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначений.Следующий() Цикл

		//Массив выгружаемых объектов
		Результат.МассивВыгруженныхСсылок.Добавить(ВыборкаЗначений.Ссылка);
		
		//Структура тела запроса
		СтруктураРезультата = Новый Структура("id, name, type");
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаЗначений);

		СтруктураРезультата.id = XMLСтрока(ВыборкаЗначений.Ссылка);;
		
		Результат.СтруктураТелаЗапроса.Добавить(СтруктураРезультата);
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции	

//++ #Б-1670 смарт: Лопато 16.12.2024 //Интеграция с ROIStat. Выгрузка интересов. Выгрузка произвольных полей, товаров и клиента.  
Функция ПолучитьДанныеИнтересовRoistat(МассивОбъектов)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
    Результат = Новый Структура;
	Результат.Вставить("СтруктураТелаЗапроса", Новый Массив);
	Результат.Вставить("МассивВыгруженныхСсылок", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Интерес КАК Интерес,
		|	ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента) КАК Заказ,
		|	ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента).Дата КАК ЗаказДата,
		|	ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента).Валюта КАК ЗаказВалюта
		|ПОМЕСТИТЬ ЗапросЗаказ
		|ИЗ
		|	РегистрСведений.CRM_ЖурналДокументов
		|ГДЕ
		|	CRM_Интерес В(&МассивИнтересов)
		|	И ГлавнаяЗапись
		|	И Объект ССЫЛКА Документ.ЗаказКлиента
		|
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Интерес,
		|	Дата КАК Дата,
		|	Номер КАК Номер,
		|	Ссылка.Партнер КАК Клиент,
		|	Тема КАК name,
		|	ЕСТЬNULL(ИсторияСостояний.смартСтатусRoistat, """") КАК СтатусRoistat,
		|	ЕСТЬNULL(ЗапросЗаказ.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)) КАК Заказ,
		|	ЕСТЬNULL(ЗапросЗаказ.ЗаказДата, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаказДата,
		|	ЕСТЬNULL(ЗапросЗаказ.ЗаказВалюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК ЗаказВалюта,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(Ссылка.ДокументОснование КАК Документ.смартЛид).Roistat_visit, """") КАК roistat,
		|	Ссылка.ТипУслуги.Наименование КАК ТипУслуги, 
		|	Ссылка.Ответственный.Наименование КАК Менеджер, 
		|	ВЫБОР 
		|		КОГДА Ссылка.смартИтоговаяКвалификация <> ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка) ТОГДА
		|			Ссылка.смартИтоговаяКвалификация.Наименование
		|		КОГДА Ссылка.смартПредварительнаяКвалификация <> ЗНАЧЕНИЕ(Справочник.смартКвалификацииМенеджеров.ПустаяСсылка) ТОГДА
		|			Ссылка.смартПредварительнаяКвалификация.Наименование
		|		ИНАЧЕ
		|		""""
		|	КОНЕЦ КАК Квалификация,
		|	ВЫБОР КОГДА ИсторияСостояний.Состояние.РеквизитДопУпорядочивания = 99 
		|		ТОГДА
		|			ПричинаОтказа
		|		ИНАЧЕ
		|			""""
		|	КОНЕЦ КАК ПричинаОтказа,
		|	ВЫБОР КОГДА ИсторияСостояний.Состояние.РеквизитДопУпорядочивания = 99 
		|		ТОГДА
		|			ПричинаОтказаКомментарий
		|		ИНАЧЕ
		|			""""
		|	КОНЕЦ КАК ПричинаОтказаКомментарий
		|ИЗ
		|	Документ.CRM_Интерес
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ИсторияСостоянийОбращений.СрезПоследних(, Обращение В(&МассивИнтересов)) КАК ИсторияСостояний
		|		ПО Ссылка = ИсторияСостояний.Обращение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапросЗаказ КАК ЗапросЗаказ
		|		ПО Ссылка = ЗапросЗаказ.Интерес
		|ГДЕ
		|	Ссылка В(&МассивИнтересов)
		|
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапросЗаказ.Интерес КАК Интерес,
		|	ЗапросЗаказ.Заказ КАК Заказ,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Номенклатура.Наименование КАК name,
		|	ЕСТЬNULL(Товары.Номенклатура.Марка.Наименование, """") КАК brand,
		|	СУММА(Товары.СуммаСНДС) КАК СуммаСНДС,
		|	СУММА(Товары.Количество) КАК Количество
		|ИЗ
		|	ЗапросЗаказ КАК ЗапросЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК Товары
		|		ПО ЗапросЗаказ.Заказ = Товары.Ссылка
		|ГДЕ
		|	НЕ Товары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	ЗапросЗаказ.Заказ,
		|	ЗапросЗаказ.Интерес,
		|	Товары.Номенклатура.Наименование,
		|	Товары.Номенклатура.Марка
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Интерес.Ссылка КАК Интерес,
		|	CRM_Взаимодействие.Дата КАК Дата,
		|	CRM_Взаимодействие.Результат КАК Результат
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|		ПО (CRM_Интерес.Партнер = CRM_Взаимодействие.Партнер)
		|           И (CRM_Интерес.Ответственный = CRM_Взаимодействие.Ответственный)
		|           И (CRM_Интерес.Дата <= CRM_Взаимодействие.Дата)
		|			И НЕ CRM_Взаимодействие.ПометкаУдаления
		|			И CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|			И НЕ ПОДСТРОКА(Результат, 1, 30) ПОДОБНО ""%Завершено автоматически%""
		|ГДЕ
		|	CRM_Интерес.Ссылка В(&МассивИнтересов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Интерес,
		|	Дата";
	
	Запрос.УстановитьПараметр("МассивИнтересов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЗначений 	  = РезультатЗапроса[1].Выбрать();
	ТаблицаТоваров  	  = РезультатЗапроса[2].Выгрузить();
	ТаблицаВзаимодействий = РезультатЗапроса[3].Выгрузить();
	
	Пока ВыборкаЗначений.Следующий() Цикл

		//Массив выгружаемых объектов
		Результат.МассивВыгруженныхСсылок.Добавить(ВыборкаЗначений.Интерес);
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЗначений.СтатусRoistat) Тогда
			Продолжить;
		КонецЕсли;	

		КоэффициентПересчетаВВалютуВзаиморасчетов = Неопределено;
		
		Если ЗначениеЗаполнено(ВыборкаЗначений.Заказ)
			И ЗначениеЗаполнено(ВыборкаЗначений.ЗаказВалюта)
			И ВыборкаЗначений.ЗаказВалюта <> ВалютаРегламентированногоУчета Тогда
			
			Коэффициенты = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентыПересчетаВалюты(ВыборкаЗначений.ЗаказВалюта, 
																					 ВалютаРегламентированногоУчета, 
																					 ВыборкаЗначений.ЗаказДата);
																					 
			КоэффициентПересчетаВВалютуВзаиморасчетов = Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов;

		КонецЕсли;
		
		//Структура тела запроса
		СтруктураРезультата = Новый Структура("id, name, client_id, date_create, status, roistat");

		ЗаполнитьЗначенияСвойств(СтруктураРезультата, ВыборкаЗначений);
		
		СтруктураРезультата.id 			= XMLСтрока(ВыборкаЗначений.Интерес);
		СтруктураРезультата.client_id	= XMLСтрока(ВыборкаЗначений.Клиент);
		СтруктураРезультата.status		= XMLСтрока(ВыборкаЗначений.СтатусRoistat);
		СтруктураРезультата.date_create = ПолучитьДатуRoistat(ВыборкаЗначений.Дата);
		
		//Дополнительные поля
		СтруктураДопПолей = Новый Структура("Номер, ТипУслуги, Квалификация, Менеджер");

		ЗаполнитьЗначенияСвойств(СтруктураДопПолей, ВыборкаЗначений);
		
		Если ЗначениеЗаполнено(ВыборкаЗначений.ПричинаОтказа) Тогда
			СтруктураДопПолей.Вставить("Причина_отказа", СокрЛП(ВыборкаЗначений.ПричинаОтказа));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаЗначений.ПричинаОтказаКомментарий) Тогда
			СтруктураДопПолей.Вставить("Причина_отказа_комментарий", СокрЛП(ВыборкаЗначений.ПричинаОтказаКомментарий));
		КонецЕсли;
		
		//Результаты взаимодействий
		СтрокиВзаимодействий = ТаблицаВзаимодействий.НайтиСтроки(Новый Структура("Интерес", ВыборкаЗначений.Интерес));
		
		Сч = 1;
		
		Для Каждого СтрокаВзаимодействия Из СтрокиВзаимодействий Цикл
			
			ТекстВзаимодействий = Формат(СтрокаВзаимодействия.Дата, "ДФ=dd.MM.yyyy")
								  + " - " + СокрЛП(СтрокаВзаимодействия.Результат);

			СтруктураДопПолей.Вставить("Результат_взаимодействия_" + Строка(Сч), Лев(ТекстВзаимодействий, 1000));
			
			Сч = Сч + 1;
			
		КонецЦикла;	
		
		СтруктураРезультата.Вставить("fields", СтруктураДопПолей);
		
		//Товары
		СтрокиТоваровИнтереса = ТаблицаТоваров.НайтиСтроки(Новый Структура("Интерес", ВыборкаЗначений.Интерес));

		СуммаТоваров  = 0;
		МассивТоваров = Новый Массив;	
		
		Для Каждого СтрокаТовара Из СтрокиТоваровИнтереса Цикл
			
			СтруктураТовара = Новый Структура("id, name, brand");
			
			ЗаполнитьЗначенияСвойств(СтруктураТовара, СтрокаТовара);
			
			СтруктураТовара.id = XMLСтрока(СтрокаТовара.Номенклатура);
			
			СуммаПоСтроке = СтрокаТовара.СуммаСНДС;
			
			Если ТипЗнч(КоэффициентПересчетаВВалютуВзаиморасчетов) = Тип("Число") Тогда
				
				СуммаПоСтроке = СуммаПоСтроке * КоэффициентПересчетаВВалютуВзаиморасчетов;
				
			КонецЕсли;

			СуммаТоваров = СуммаТоваров + СуммаПоСтроке;
			
			СтруктураТовара.Вставить("quantity", СтрокаТовара.Количество);
			СтруктураТовара.Вставить("price",    ?(СтрокаТовара.Количество <> 0, 
													   СуммаПоСтроке / СтрокаТовара.Количество, 0));
			
			//category
			ПолноеНаименованиеНоменклатуры = СтрокаТовара.Номенклатура.ПолноеНаименование();
			ПутьКНоменклатуре = СтрЗаменить(ПолноеНаименованиеНоменклатуры, "/" + СтрокаТовара.name, ""); 
			
			ПутьМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ПутьКНоменклатуре, "/");
			
			СтруктураКатегории = Новый Структура; 
			
			НомерУровня = 1;
			
			Пока НомерУровня <= ПутьМассив.Количество() И НомерУровня <= 5 Цикл
				
				Уровень = ПутьМассив[НомерУровня - 1];
				
				СтруктураКатегории.Вставить("level" + Строка(НомерУровня), Уровень);
				
				НомерУровня = НомерУровня + 1;
			   
			КонецЦикла;   
			
			СтруктураТовара.Вставить("category", СтруктураКатегории);
			
			МассивТоваров.Добавить(СтруктураТовара);
			
		КонецЦикла;	
		
		СтруктураРезультата.Вставить("price", СуммаТоваров);
		
		Если МассивТоваров.Количество() > 0 Тогда
			СтруктураРезультата.Вставить("products", МассивТоваров);
		КонецЕсли;	

		Результат.СтруктураТелаЗапроса.Добавить(СтруктураРезультата);
			
	КонецЦикла;

	Возврат Результат;
	
КонецФункции //-- #Б-1670 смарт: Лопато 16.12.2024

//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
Функция ПолучитьДанныеЗаказовRoistat(МассивОбъектов)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
    Результат = Новый Структура;
	Результат.Вставить("СтруктураТелаЗапроса", Новый Массив);
	Результат.Вставить("МассивВыгруженныхСсылок", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Заказ,
		|	Дата КАК Дата,
		|	Номер КАК Номер,
		|	Валюта КАК Валюта,
		|	Партнер КАК Партнер,
		|	Менеджер КАК Менеджер,
		|	ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ ЗапросЗаказ
		|ИЗ
		|	Документ.ЗаказКлиента
		|ГДЕ
		|	Ссылка В(&МассивОбъектов)
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапросЗаказ.Заказ КАК Заказ,
		|	Дата КАК ЗаказДата,
		|	Номер КАК ЗаказНомер,
		|	Валюта КАК ЗаказВалюта,
		|	Партнер КАК Партнер,
		|	Менеджер.Наименование КАК Менеджер,
		|	ВЫБОР
		|		КОГДА ПометкаУдаления 
		|			  	  ИЛИ (СостоянияЗаказовКлиентов.ПроцентОплаты = 0
		|				   	   И СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт))
		|			ТОГДА &СтатусRoistatЗавершенНеудачно
		|		КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты = 100
		|			ТОГДА &СтатусRoistatСчетОплаченПолностью
		|		КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты > 0
		|			ТОГДА &СтатусRoistatСчетОплаченЧастично
		|		ИНАЧЕ &СтатусRoistatСчетВыставлен
		|	КОНЕЦ КАК СтатусRoistat,
		|	ЕСТЬNULL(ДополнительныеСведенияRoistat_Visit.Значение, """") КАК roistat
		|ИЗ
		|	ЗапросЗаказ КАК ЗапросЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияRoistat_Visit
		|   	ПО Объект = Заказ И Свойство = &СвойствоRoistat_Visit
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|		ПО СостоянияЗаказовКлиентов.Заказ = ЗапросЗаказ.Заказ
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапросЗаказ.Заказ КАК Заказ,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Номенклатура.Наименование КАК name,
		|	ЕСТЬNULL(Товары.Номенклатура.Марка.Наименование, """") КАК brand,
		|	СУММА(Товары.СуммаСНДС) КАК СуммаСНДС,
		|	СУММА(Товары.Количество) КАК Количество
		|ИЗ
		|	ЗапросЗаказ КАК ЗапросЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК Товары
		|		ПО ЗапросЗаказ.Заказ = Товары.Ссылка
		|ГДЕ
		|	НЕ Товары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура,
		|	ЗапросЗаказ.Заказ,
		|	Товары.Номенклатура.Наименование,
		|	Товары.Номенклатура.Марка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	СвойствоRoistat_Visit = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "Roistat_Visit");
	Запрос.УстановитьПараметр("СвойствоRoistat_Visit", СвойствоRoistat_Visit);

	Запрос.УстановитьПараметр("СтатусRoistatСчетВыставлен", 	   Справочники.смартСтатусыRoistat.НайтиПоКоду("03"));
	Запрос.УстановитьПараметр("СтатусRoistatСчетОплаченЧастично",  Справочники.смартСтатусыRoistat.НайтиПоКоду("04"));
	Запрос.УстановитьПараметр("СтатусRoistatСчетОплаченПолностью", Справочники.смартСтатусыRoistat.НайтиПоКоду("05"));
	Запрос.УстановитьПараметр("СтатусRoistatЗавершенНеудачно",	   Справочники.смартСтатусыRoistat.НайтиПоКоду("06"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЗначений 	  = РезультатЗапроса[1].Выбрать();
	ТаблицаТоваров  	  = РезультатЗапроса[2].Выгрузить();
	
	Пока ВыборкаЗначений.Следующий() Цикл

		//Массив выгружаемых объектов
		Результат.МассивВыгруженныхСсылок.Добавить(ВыборкаЗначений.Заказ);
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЗначений.СтатусRoistat) Тогда
			Продолжить;
		КонецЕсли;	

		КоэффициентПересчетаВВалютуВзаиморасчетов = Неопределено;
		
		Если ЗначениеЗаполнено(ВыборкаЗначений.Заказ)
			И ЗначениеЗаполнено(ВыборкаЗначений.ЗаказВалюта)
			И ВыборкаЗначений.ЗаказВалюта <> ВалютаРегламентированногоУчета Тогда
			
			Коэффициенты = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентыПересчетаВалюты(ВыборкаЗначений.ЗаказВалюта, 
																					 ВалютаРегламентированногоУчета, 
																					 ВыборкаЗначений.ЗаказДата);
																					 
			КоэффициентПересчетаВВалютуВзаиморасчетов = Коэффициенты.КоэффициентПересчетаВВалютуВзаиморасчетов;

		КонецЕсли;
		
		//Структура тела запроса
		СтруктураРезультата = Новый Структура("id, name, client_id, date_create, status, price, roistat");

		СтруктураРезультата.id 			= XMLСтрока(ВыборкаЗначений.Заказ);
		СтруктураРезультата.name 		= "Заказ с сайта Smart.shop " + СокрЛП(ВыборкаЗначений.ЗаказНомер);
		СтруктураРезультата.client_id	= XMLСтрока(ВыборкаЗначений.Партнер);
		СтруктураРезультата.date_create = ПолучитьДатуRoistat(ВыборкаЗначений.ЗаказДата);
		СтруктураРезультата.status		= XMLСтрока(ВыборкаЗначений.СтатусRoistat);
		СтруктураРезультата.roistat		= СокрЛП(ВыборкаЗначений.roistat);
		
		//Дополнительные поля
		СтруктураДопПолей = Новый Структура("Менеджер");

		ЗаполнитьЗначенияСвойств(СтруктураДопПолей, ВыборкаЗначений);
		
		СтруктураРезультата.Вставить("fields", СтруктураДопПолей);
		
		//Товары
		СтрокиТоваровИнтереса = ТаблицаТоваров.НайтиСтроки(Новый Структура("Заказ", ВыборкаЗначений.Заказ));

		СуммаТоваров  = 0;
		МассивТоваров = Новый Массив;	
		
		Для Каждого СтрокаТовара Из СтрокиТоваровИнтереса Цикл
			
			СтруктураТовара = Новый Структура("id, name, brand");
			
			ЗаполнитьЗначенияСвойств(СтруктураТовара, СтрокаТовара);
			
			СтруктураТовара.id = XMLСтрока(СтрокаТовара.Номенклатура);
			
			СуммаПоСтроке = СтрокаТовара.СуммаСНДС;
			
			Если ТипЗнч(КоэффициентПересчетаВВалютуВзаиморасчетов) = Тип("Число") Тогда
				
				СуммаПоСтроке = СуммаПоСтроке * КоэффициентПересчетаВВалютуВзаиморасчетов;
				
			КонецЕсли;

			СуммаТоваров = СуммаТоваров + СуммаПоСтроке;
			
			СтруктураТовара.Вставить("quantity", СтрокаТовара.Количество);
			СтруктураТовара.Вставить("price",    ?(СтрокаТовара.Количество <> 0, 
													   СуммаПоСтроке / СтрокаТовара.Количество, 0));
			
			//category
			ПолноеНаименованиеНоменклатуры = СтрокаТовара.Номенклатура.ПолноеНаименование();
			ПутьКНоменклатуре = СтрЗаменить(ПолноеНаименованиеНоменклатуры, "/" + СтрокаТовара.name, ""); 
			
			ПутьМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ПутьКНоменклатуре, "/");
			
			СтруктураКатегории = Новый Структура; 
			
			НомерУровня = 1;
			
			Пока НомерУровня <= ПутьМассив.Количество() И НомерУровня <= 5 Цикл
				
				Уровень = ПутьМассив[НомерУровня - 1];
				
				СтруктураКатегории.Вставить("level" + Строка(НомерУровня), Уровень);
				
				НомерУровня = НомерУровня + 1;
			   
			КонецЦикла;   
			
			СтруктураТовара.Вставить("category", СтруктураКатегории);
			
			МассивТоваров.Добавить(СтруктураТовара);
			
		КонецЦикла;	
		
		СтруктураРезультата.Вставить("price", СуммаТоваров);
		
		Если МассивТоваров.Количество() > 0 Тогда
			СтруктураРезультата.Вставить("products", МассивТоваров);
		КонецЕсли;	

		Результат.СтруктураТелаЗапроса.Добавить(СтруктураРезультата);
			
	КонецЦикла;

	Возврат Результат;
	
КонецФункции //-- #Б-2560 смарт: Лопато 11.03.2025

//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
Функция ПолучитьМассивКлиентов(МассивОбъектов, НаименованиеОбъекта)
	
	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(НаименованиеОбъекта) Тогда
		Возврат Результат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Партнер КАК Партнер
		|ИЗ
		|" + НаименованиеОбъекта + "
		|ГДЕ
		|	Ссылка В(&МассивОбъектов)
		|	И Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Попытка
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Партнер");
	Исключение
		Возврат Новый Массив;
	КонецПопытки;	
	
	Возврат Результат;
	
КонецФункции //-- #Б-2560 смарт: Лопато 11.03.2025
	
//++ #Б-1670 смарт: Лопато 16.12.2024 //Интеграция с ROIStat. Выгрузка интересов. Выгрузка произвольных полей, товаров и клиента.  
Функция ПолучитьДанныеКлиентовRoistat(МассивОбъектов)

    Результат = Новый Структура;
	Результат.Вставить("СтруктураТелаЗапроса", Новый Массив);
	Результат.Вставить("МассивВыгруженныхСсылок", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Ссылка,
		//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
		|	ДатаРегистрации КАК ДатаРегистрации,
		//-- #Б-2560 смарт: Лопато 11.03.2025
		|	Наименование КАК Наименование
		|ИЗ
		|	Справочник.Партнеры
		|ГДЕ
		|	Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
			
	ВыборкаЗначений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначений.Следующий() Цикл
		
		//Структура тела запроса
		СтруктураРезультата = Новый Структура("id, name, birth_date");

		СтруктураРезультата.id 	 = XMLСтрока(ВыборкаЗначений.Ссылка);
		СтруктураРезультата.name = ВыборкаЗначений.Наименование;
		//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
		СтруктураРезультата.birth_date = Формат(ВыборкаЗначений.ДатаРегистрации, "ДФ='yyyy-MM-dd'");
		//-- #Б-2560 смарт: Лопато 11.03.2025
			
		Результат.СтруктураТелаЗапроса.Добавить(СтруктураРезультата);
			
	КонецЦикла;

	Возврат Результат;
	
КонецФункции //-- #Б-1670 смарт: Лопато 16.12.2024

Функция ПолучитьИзмененияПоУзлу(Узел, НаименованиеОбъекта)

    Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ
	|" + НаименованиеОбъекта + ".Изменения
	|ГДЕ
	|   Узел = &Узел";

	Запрос.УстановитьПараметр("Узел", Узел);
			
	ВыборкаЗначений = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗначений.Следующий() Цикл

		Результат.Добавить(ВыборкаЗначений.Ссылка);
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции	

Функция ПолучитьПараметрыОбменаRoistat(Url, RoistatProject = "", Сервис = "", Ресурс = "", Метод = "", НачалоПериода = Неопределено, ОкончаниеПериода = Неопределено) Экспорт
	
	ПараметрыОбмена = Новый Соответствие;

	ПараметрыОбмена.Вставить("url",		   Url);
	ПараметрыОбмена.Вставить("api",		   "v1");
	ПараметрыОбмена.Вставить("context",	   "project");
	ПараметрыОбмена.Вставить("service",	   Сервис);
	ПараметрыОбмена.Вставить("resource",   Ресурс);
	ПараметрыОбмена.Вставить("method",	   Метод);
	ПараметрыОбмена.Вставить("accept",	   "application/json");
	ПараметрыОбмена.Вставить("api-key",	   ПолучитьRoistatAPIKey());
	
	СтруктураПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(RoistatProject) Тогда
		СтруктураПараметров.Вставить("project", RoistatProject);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(ОкончаниеПериода) Тогда

		СтруктураПараметров.Вставить("period", НачалоПериода + "-" + ОкончаниеПериода);
									   
	КонецЕсли;	

	ПараметрыОбмена.Вставить("Параметры", СтруктураПараметров);
	
	Возврат ПараметрыОбмена;
	
КонецФункции

//Функция получения адреса запроса
//Структура адреса: https://[url]/api/v1/[Контекст]/[Сервис]/[Ресурс]/[Метод]?project=[Проект]
Функция ПолучитьАдресРесурсаRoistat(ПараметрыОбмена)
	
	api = "/api/" + ПараметрыОбмена.Получить("api");
	
	context =  ?(ПараметрыОбмена.Получить("context") <> Неопределено, 
				 ?(ЗначениеЗаполнено(ПараметрыОбмена.Получить("context")), 
				   "/" + ПараметрыОбмена.Получить("context"), ""), "");
				
	service =  ?(ПараметрыОбмена.Получить("service") <> Неопределено, 
			 	 ?(ЗначениеЗаполнено(ПараметрыОбмена.Получить("service")), 
				   "/" + ПараметрыОбмена.Получить("service"), ""), "");
				
	resource = ?(ПараметрыОбмена.Получить("resource") <> Неопределено, 
				 ?(ЗначениеЗаполнено(ПараметрыОбмена.Получить("resource")), 
				   "/" + ПараметрыОбмена.Получить("resource"), ""), "");
				 
	method =   ?(ПараметрыОбмена.Получить("method") <> Неопределено, 
			     ?(ЗначениеЗаполнено(ПараметрыОбмена.Получить("method")), 
				   "/" + ПараметрыОбмена.Получить("method"), ""), "");

	АдресРесурса = api + context + service + resource + method;
						
	СтруктураПараметров = ПараметрыОбмена.Получить("Параметры");				
					
	Если СтруктураПараметров.Количество() > 0 Тогда
		
		СтрокаПараметров = "?";
		
		Для Каждого ЭлементПараметр Из СтруктураПараметров Цикл
			СтрокаПараметров = СтрокаПараметров + ЭлементПараметр.Ключ + "=" + ЭлементПараметр.Значение + "&";
		КонецЦикла;
		
		АдресРесурса = АдресРесурса + Лев(СтрокаПараметров, СтрДлина(СтрокаПараметров) - 1);
		
	КонецЕсли;
	
	Возврат АдресРесурса;
	
КонецФункции

Функция ВыполнитьЗапросRoistat(ВидЗапроса, ПараметрыОбмена, ТелоЗапроса = Неопределено) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("accept",	   ПараметрыОбмена.Получить("accept"));
	Заголовки.Вставить("Content-Type", ПараметрыОбмена.Получить("accept"));
	Заголовки.Вставить("Api-key", 	   ПараметрыОбмена.Получить("api-key"));
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);

	Соединение = Новый HTTPСоединение(ПараметрыОбмена.Получить("url"), , , , , , ЗащищенноеСоединение);
					 
	HTTPЗапрос = Новый HTTPЗапрос(ПолучитьАдресРесурсаRoistat(ПараметрыОбмена), Заголовки);
	
	Если ВРег(ВидЗапроса) = "GET" Тогда
		
		HTTPОтвет = Соединение.Получить(HTTPЗапрос);
		
	ИначеЕсли ВРег(ВидЗапроса) = "POST" Тогда
		
		Если ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		ИначеЕсли ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные") Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		КонецЕсли;
	 
	    HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

Функция ПолучитьRoistatAPIKey()

	Возврат СокрЛП(Справочники.смартПредопределенныеЗначения.Настройки.RoistatAPIKey);
	
КонецФункции	

//++ #Б-1680 смарт: Лопато 13.12.2024 //Интеграция с ROIStat. Загрузка ProxyLeads. Загрузить данные.  
Процедура ЗагрузитьProxyLeads(МассивProxyLeads)
	
	Если НЕ ТипЗнч(МассивProxyLeads) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;	
	
	СоответствиеПолейProxyLeads = Новый Соответствие;

	СоответствиеПолейProxyLeads.Вставить("ИдентификаторROIStat", "id");
	СоответствиеПолейProxyLeads.Вставить("Наименование",		 "title");
	СоответствиеПолейProxyLeads.Вставить("Описание", 			 "text");
	СоответствиеПолейProxyLeads.Вставить("ФИО", 				 "name");
	СоответствиеПолейProxyLeads.Вставить("Телефон", 			 "phone");
	СоответствиеПолейProxyLeads.Вставить("Email", 				 "email");
	СоответствиеПолейProxyLeads.Вставить("НомерВизита", 		 "roistat");
	СоответствиеПолейProxyLeads.Вставить("ДатаСоздания", 		 "creation_date");
	СоответствиеПолейProxyLeads.Вставить("ИдентификаторСделки",  "order_id");
	СоответствиеПолейProxyLeads.Вставить("ДополнительныеПоля",   "order_fields");
	СоответствиеПолейProxyLeads.Вставить("ЭтоСпам",   			 "is_spam");
	СоответствиеПолейProxyLeads.Вставить("Тип",				     "engine_type");
	
	МассивID = Новый Массив;

	Для Каждого ProxyLeads Из МассивProxyLeads Цикл
		
		ЗначениеID = ProxyLeads.Получить("id");
		
		Если ЗначениеЗаполнено(ЗначениеID) Тогда
			МассивID.Добавить(ЗначениеID);
		КонецЕсли;	
			
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИдентификаторROIStat КАК ID
		|ИЗ
		|	РегистрСведений.смартПроксиЛидыROIStat
		|ГДЕ
		|	ИдентификаторROIStat В (&МассивID)";
	
	Запрос.УстановитьПараметр("МассивID", МассивID);
	РезультатID = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ID");
	
	Для Каждого ProxyLeads Из МассивProxyLeads Цикл

		ЗначениеID = ProxyLeads.Получить("id");
		
		Если ЗначениеЗаполнено(ЗначениеID) 
			И РезультатID.Найти(ЗначениеID) = Неопределено Тогда

			НоваяЗапись = РегистрыСведений.смартПроксиЛидыROIStat.СоздатьМенеджерЗаписи();
			
			Для Каждого Поле Из СоответствиеПолейProxyLeads Цикл
				
				ЗначениеПоля = ProxyLeads.Получить(Поле.Значение);
				
				Если Поле.Ключ = "ДополнительныеПоля" Тогда
					НоваяЗапись[Поле.Ключ] = ЗаписатьОбъектВJSON(ЗначениеПоля);
				ИначеЕсли Поле.Ключ = "ДатаСоздания" Тогда
					НоваяЗапись[Поле.Ключ] = МестноеВремя(
											     СтрЗаменить(
												     СтрЗаменить(
													     СтрЗаменить(
													  	     ЗначениеПоля,
														 "-", ""),
													 ":", ""), 
												 " ", ""));
				Иначе	
					НоваяЗапись[Поле.Ключ] = ЗначениеПоля;
				КонецЕсли;
				
			КонецЦикла;
			
			НоваяЗапись.Записать();
			
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры //-- #Б-1680 смарт: Лопато 13.12.2024

//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
Функция ПолучитьНаименованиеОбъекта(ОбъектВыгрузки)

	НаименованиеОбъекта = "";

	Если ТипЗнч(ОбъектВыгрузки) = Тип("Строка") Тогда
		
		НаименованиеОбъекта = ОбъектВыгрузки;
		
	ИначеЕсли ТипЗнч(ОбъектВыгрузки) = Тип("Массив") Тогда
		
		Если ТипЗнч(ОбъектВыгрузки[0]) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			НаименованиеОбъекта = "Документ.CRM_Интерес";
		ИначеЕсли ТипЗнч(ОбъектВыгрузки[0]) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			НаименованиеОбъекта = "Документ.ЗаказКлиента";
		КонецЕсли;	
			
	КонецЕсли;	
	
	Возврат НаименованиеОбъекта;

КонецФункции //-- #Б-2560 смарт: Лопато 11.03.2025	

#КонецОбласти

#Область Прочее

// Приводит дату к формату Roistat с поправкой на часовой пояс 
//
// Параметры:
//  Дата - дата 
//  Формат - формат даты
//  ЧасовойПояс - смещение времени в виде +0100, по умолчанию приводится к московскому времени +0300. 
//				  По умолчанию все даты в Roistat интерпретируются 
//				  в часовом поясе UTC+0 как 2024-01-01 12:00:00+00:00 
//
// Возвращаемое значение:
//  Дата в формате строки.
//
Функция ПолучитьДатуRoistat(Дата, ЧасовойПояс = "+0300")

	Возврат Формат(Дата, "ДФ='yyyy-MM-dd hh:mm:ss'") + ЧасовойПояс;
	
КонецФункции	

// Сериализует структуру, соответствие, массив в строку JSON
//
// Параметры:
//  Объект - структура, соответствие, массив
//
// Возвращаемое значение:
//  Строка - сериализованный объект в виде строки JSON.
//
Функция ЗаписатьОбъектВJSON(Объект)
	
	Запись = Новый ЗаписьJSON;
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "	", Истина);
    Запись.УстановитьСтроку(ПараметрыЗаписи);
    ЗаписатьJSON(Запись, Объект);
	
    Возврат Запись.Закрыть();
	
КонецФункции

// Десериализует строку JSON в соответствие
//
// Параметры:
//  Строка - Строка
//
// Возвращаемое значение:
//  Соответствие.
//
Функция ПрочитатьОбъектИзJSON(Стр)
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Стр);
	Попытка
    	Объект = ПрочитатьJSON(Чтение, Истина);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Объект = Неопределено;
		ЗаписьЖурналаРегистрации("Обмен с Roistat", УровеньЖурналаРегистрации.Ошибка, , Стр, ОписаниеОшибки);
	КонецПопытки;
	
    Возврат Объект;
	
КонецФункции

#КонецОбласти

#Область Обмен

// Процедура - Процедура регистрирует изменения перед записью регистров
//  
Процедура ЗарегистрироватьИзмененияПриЗаписиРегистраСведенийДляОбменаRoistat(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ Отказ Тогда
		
		ЗарегистрироватьИзмененияRoistat(Источник, Замещение);
		
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - Процедура регистрирует изменения при записи справочников и документов
//  
Процедура ЗарегистрироватьИзмененияПриЗаписиСправочникаДокументаДляОбменаRoistat(Источник, Отказ) Экспорт
	
	Если НЕ Отказ Тогда
		
		ЗарегистрироватьИзмененияRoistat(Источник);
		
	КонецЕсли;	
	
КонецПроцедуры

// Смарт внесены изменения
// Общая процедура регистрации объектов 1С
//
Процедура ЗарегистрироватьИзмененияRoistat(Объект, Замещение = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);

	RoistatAPIKey = ПолучитьRoistatAPIKey();
	
	Если НЕ ЗначениеЗаполнено(RoistatAPIKey)
		ИЛИ (Объект.ДополнительныеСвойства.Свойство("НеРегистрироватьИзмененияДляСайта")
			 И Объект.ДополнительныеСвойства.НеРегистрироватьИзмененияДляСайта = Истина) Тогда
		
		Возврат;
		
	КонецЕсли;	

	МассивУзловRoistat = смартПолучитьМассивУзловRoistat();
		
	Если МассивУзловRoistat.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТипОбъекта = ТипЗнч(Объект);

	МассивОбъектовДляРегистрации = Новый Массив;
	
	Если ТипОбъекта = Тип("ДокументОбъект.CRM_Интерес") Тогда
		
		Если НужноРегистрироватьИнтерес(Объект.Ссылка) Тогда
			
			МассивОбъектовДляРегистрации.Добавить(Объект.Ссылка);
			
		КонецЕсли;	

	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.CRM_ИсторияСостоянийОбращений") тогда 

		Для Каждого ТекущаяЗаписьСостояния Из Объект Цикл
			
			Если ЗначениеЗаполнено(ТекущаяЗаписьСостояния.смартСтатусRoistat)
				И НужноРегистрироватьИнтерес(ТекущаяЗаписьСостояния.Обращение) Тогда
				
				МассивОбъектовДляРегистрации.Добавить(ТекущаяЗаписьСостояния.Обращение);
				
			КонецЕсли;	

		КонецЦикла;										   

	ИначеЕсли ТипОбъекта = Тип("СправочникОбъект.смартСтатусыRoistat") тогда 
		
		МассивОбъектовДляРегистрации.Добавить(Объект.Ссылка);

	//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
	ИначеЕсли ТипОбъекта = Тип("ДокументОбъект.ЗаказКлиента") тогда 
		
		Если НужноРегистрироватьЗаказКлиента(Объект) Тогда
			МассивОбъектовДляРегистрации.Добавить(Объект.Ссылка);
		КонецЕсли;	

	ИначеЕсли ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.СостоянияЗаказовКлиентов") тогда 
		
		Для Каждого ТекущаяЗаписьСостояния Из Объект Цикл

			Если НужноРегистрироватьЗаказКлиента(ТекущаяЗаписьСостояния.Заказ) Тогда
				МассивОбъектовДляРегистрации.Добавить(ТекущаяЗаписьСостояния.Заказ);
			КонецЕсли;	
			
		КонецЦикла;										   
	//-- #Б-2560 смарт: Лопато 11.03.2025
		
	КонецЕсли;
	
	//Регистрация объектов на узлах
	Если МассивОбъектовДляРегистрации.Количество() > 0 Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловRoistat, МассивОбъектовДляРегистрации);

	КонецЕсли;
	
КонецПроцедуры

Функция смартПолучитьМассивУзловRoistat()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.смартОбменRoistat
	|ГДЕ
	|	НЕ ЭтотУзел
	|	И НЕ ПометкаУдаления
	|	И RoistatProject <> """"
	|	И URL <> """"";
	
	ТаблицаУзлов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаУзлов.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция НужноРегистрироватьИнтерес(Интерес)

	Результат = Ложь;

	// Инициализация настроек
	RoistatСхемаОтбораИнтересов = Справочники.смартПредопределенныеЗначения.ПолучитьМакет("RoistatСхемаОтбораИнтересов");

	RoistatНастройкиОтбораИнтересов = Справочники.смартПредопределенныеЗначения.Настройки.RoistatНастройкиОтбораИнтересов.Получить();
	
	Если ТипЗнч(RoistatНастройкиОтбораИнтересов) = Тип("НастройкиКомпоновкиДанных") Тогда
		НастройкиКомпоновкиОтбораИнтересов = RoistatНастройкиОтбораИнтересов;
	Иначе
		НастройкиКомпоновкиОтбораИнтересов = RoistatСхемаОтбораИнтересов.НастройкиПоУмолчанию;
	КонецЕсли;

	ИсточникНастроекОтбораИнтересов = Новый ИсточникДоступныхНастроекКомпоновкиДанных(
										        ПоместитьВоВременноеХранилище(RoistatСхемаОтбораИнтересов, Новый УникальныйИдентификатор()));

	// Инициализация компоновщика
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроекОтбораИнтересов);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиОтбораИнтересов);

	// Установка параметров СКД
	ПараметрКомпановкиДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИнтересСсылка");
	ПараметрКомпановкиДанных.Значение = Интерес;
	ПараметрКомпановкиДанных.Использование = Истина;	
	
	// Инициализация компоновки СКД
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(RoistatСхемаОтбораИнтересов, КомпоновщикНастроек.Настройки, , , 
												  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	// Получаем таблицу значений результата запроса	
	ТаблицаИнтересов = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаИнтересов);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ТаблицаИнтересов.Количество() > 0 Тогда;
		Результат = Истина;
	КонецЕсли;	
		
	Возврат Результат
	
КонецФункции	

//++ #Б-2560 смарт: Лопато 11.03.2025 //Интеграция с ROIStat. Добавление в выгрузку документа Заказ покупателя.  
Функция НужноРегистрироватьЗаказКлиента(ЗаказОбъект)

	Результат = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента) КАК Заказ
	|ПОМЕСТИТЬ ОнлайнЗаказы
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения
	|ГДЕ
	|   ВЫРАЗИТЬ(Объект КАК Документ.ЗаказКлиента) = &Заказ
	|	И Свойство = &Свойство
	|	И Значение = &Значение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ДокументОснование КАК Документ.ЗаказКлиента) КАК Заказ
	|ПОМЕСТИТЬ Обработанные
	|ИЗ
	|	Документ.смартЛид
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОнлайнЗаказы 
	|		ПО ((ВЫРАЗИТЬ(ДокументОснование КАК Документ.ЗаказКлиента)) = ОнлайнЗаказы.Заказ)
	|			И (НЕ ПометкаУдаления)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОнлайнЗаказы.Заказ КАК Заказ
	|ИЗ
	|	ОнлайнЗаказы КАК ОнлайнЗаказы	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Обработанные КАК Обработанные
	|		ПО (ОнлайнЗаказы.Заказ = Обработанные.Заказ)
	|ГДЕ		
	|	Обработанные.Заказ ЕСТЬ NULL";
	
	СвойствоОффлайнЗаказ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ОффлайнЗаказ");
    ЗначениеОффлайнЗаказ = "N";
	
	Запрос.УстановитьПараметр("Свойство", СвойствоОффлайнЗаказ);
	Запрос.УстановитьПараметр("Значение", ЗначениеОффлайнЗаказ);
	Запрос.УстановитьПараметр("Заказ", 	  ЗаказОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЦФО 	 = Справочники.смартПредопределенныеЗначения.Настройки.РаспределениеЗаказовСайтаБизнесРегионЦФО;
		СуммаЦФО = Справочники.смартПредопределенныеЗначения.Настройки.РаспределениеЗаказовСайтаСуммаЦФО;

		ЗаказБизнесРегион = ЗаказОбъект.Партнер.БизнесРегион;
		
		Если (ЗаказОбъект.СуммаДокумента <= СуммаЦФО
			  И (ЗаказБизнесРегион = ЦФО ИЛИ ЗаказБизнесРегион.ПринадлежитЭлементу(ЦФО))) Тогда
				 
			Результат = Истина;
			
		КонецЕсли;	
				 
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции //-- #Б-2560 смарт: Лопато 11.03.2025

#КонецОбласти
